Tekla Open API Reference for Tekla Structures 2025
Operation Methods
The Operation type exposes the following members.
Methods
Name | Description
MoveAnalysisPartAreaEdge
 Moves the analysis part area edge by translation vector. Perpendicular offset is calculated from the translation vector.
MoveAnalysisPartPosition
 Moves the analysis part position by translation vector. Only the handle positions can be moved.
MoveObject
 Moves the analysis object by translation vector. Supported objects are: AnalysisNode, AnalysisPart.
ResetAnalysisPartPositions
 Reset analysis part. Removes the offsets applied to node positions. The axis offset of the analysis part is not reset.
Top
See Also
Reference
Operation Class
Tekla.Structures.Analysis.Operations Namespace